[
    {
        "status": 200,
        "message": "success",
        "data": [
            {
                "id": 1,
                "title": "If you want to be a professional web developer",
                "category_id": 1,
                "photo": "images/1.jpg",
                "description": "ခေါင်းစဉ်လေး အတိုင်းပါပဲ။ အကယ်၍ သင်ဟာ professional web developer တစ်ယောက်ဖြစ်ချင်တယ်ဆိုရင်ပေါ့။ ဘာတွေလေ့လာရမလဲ။ ဘယ်လိုလျှောက်လှမ်းရမလဲ ဆိုတာကို ကျွန်တော့်ရဲ့ အတွေ့အကြုံနဲ့ ယှဉ်ပြီးပြောပြသွားမှာပါ။ ပထမဆုံးအနေနဲ့ ဘာတွေလေ့လာရမလဲ။ ဘာတွေလေ့လာရမလဲ ဆိုတာ မပြောခင် Web development ပိုင်းမှာ frontend နဲ့ backend နှစ်ပိုင်းရှိတယ်ဆိုတာ အရင်ပြောပါရစေ။ frontend ဆိုတာ UI (User Interface)/ UX (User Experience) အပိုင်းပါ။ အဓိက အားဖြင့် user တစ်ယောက် မျက်စိနဲ့ မြင်ရမဲ့ design ကို ဖန်တီးရေးဆွဲရတဲ့အပိုင်းပေါ့။ Web Design အပိုင်းလို့လဲ နားလည်ထားလို့ရပါတယ်။ ဒီ Web Design အပိုင်းမှာ ဘာတွေလေ့လာရမလဲဆို Basic နဲ့ Advanced Level နှစ်မျိုး ခွဲပြောပါ့မယ်။ Basic မှာဆို HTML, CSS, Bootstrap, Javascript, JQuery ဒီငါးခုပါ။ skill ကြမ်းနေပြီဆိုရင် ဒီ basic ငါးခုနဲ့တင် Frontend လောကမှာ ဘာဆိုလား လုပ်လို့ရပါတယ်။ တစ်ခုစီရဲ့အကြောင်းကို နောက်ထပ် posts တွေမှာ ထပ်ရှင်းပါမယ်။ ဒီ ငါးခုပြီးရင် Backend ပိုင်းကို ဆက်ပြီး ခြေဆန့်ရမှာပါ။ Frontend Advanced Level မှာ ဘာတွေလေ့လာရမလဲဆိုတော့ SPA (Single Page Application) တွေရေးဖို့အတွက် VueJs, ReactJs, AngularJs ဒါတွေ လက်ကိုင်ထားရပါမယ်။ သုံးခုလုံးမလေ့လာနိုင်ရင်တောင် တစ်ခုလောက်ကတော့ လက်စွဲထားရပါမယ်။ ဒီသုံးခုမှာတောင် next level တွေရှိပါသေးတယ်။ ဒါတွေကိုလဲ နောက်မှပြောပါမယ်။ အဓိက ဒီသုံးခုက Website တစ်ခုကို reload မဖြစ်စေပဲ data binding နဲ့ rendering လုပ်သွားတာပါ။ ဥပမာ facebook ကိုကြည့်ပါ။ ReactJs နဲ့ရေးထားတာပါ။ page reload မရှိဘူး။ မြန်ဆန်တယ်။ Design Rendering ကို လိုသလို စီမံလို့ရတယ်။ ဒါရဲ့ next level တွေဆိုတာက state management တွေ ဘာညာပေါ့။ ဟုတ်ပြီ။ ဒီလိုဆို Backend ပိုင်း ဆက်သွားရအောင်။ ဒီဘက်က နဲနဲပိုကျယ်ပြန့်တယ်ဗျ။ အရင်ဆုံး PHP ကို ဂျွတ်နေအောင် လေ့လာရမယ်။ Procedural (Pure PHP), OOP, MVC အကုန်သိနေရမယ်။ ဒါတွေမပိုင်ပဲ ရှေ့မဆက်စေချင်ဘူး။ ပြီးတော့ MySQL, AJAX, JSON (API)တွေကိုဆက်လေ့လာရမှာပါ။ ပိုင်ပြီဆိုရင်တော့ Laravel ကိုသွားစေချင်တယ်။ Laravel က အခုချိန်မှာ version 8 အထိရောက်နေပြီး PHP God Framework အဖြစ် နေမဝင် အင်ပါယာကို သူနယ်ချဲ့နေတာပါ။ တော်ရုံ ERP solution လောက်ကို laravel နဲ့ကောင်းကောင်းကြီး ကျုံးလို့ရပါတယ်။ livewire ဆိုရင်လဲ VueJs, ReactJs, AngularJs တို့လို SPA ပုံစံပါ။ ဒီ့အပြင် သူ့မှာ နောက်ထပ် package တွေ အများကြီးပါ။ MVC Framework ဖြစ်တဲ့အတွက် ရေးရတာလဲ ခြေမြန်လက်မြန် အတော်ရှိပါတယ်။ တော်တော် အရာရောက်တဲ့ PHP framework ပါ။ ဒီအထိရနေရင်တော့ Professional Web Developer အဖြစ် ကောင်းကောင်း လှုပ်ရှားလို့ရနေပါပြီ။ ဆက်ပြီး လေ့လာချင်ရင်တော့ MEAN Stack (MongoDB, ExpressJs, AngularJs, NodeJs), MERN Stack (MongoDB, ExpressJs, ReactJs, NodeJs) နဲ့ Hybrid Mobile Application Development (VueNative, React Native, Flutter, Ionic) ဘာညာ အများကြီး ဆက်လေ့လာနိုင်ပါတယ်။ ဒီလောက်ဆိုရင်တော့ တော်တော် အဆင်ပြေနေပါပြီ။ ကျန်တာကတော့ ကိုယ့်ရဲ့ လေ့လာအားထုတ်မှု၊ ကြိုးစားမှုနဲ့ skill အပေါ်ပဲ မူတည်ပါတယ်။ "
            }
        ]
    }
]